# FabricationDimensionDefinition Properties

---
The FabricationDimensionDefinition type exposes the following members.
| Name| Description
---|---|---
| IsModifiable|  If the fabrication dimension is modifiable by user.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  Fabrication dimension name.
| Type|  Fabrication dimension type.
| UnitType|  Fabrication dimension unit type.
Top
#### Reference
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace